import streamlit as st

# ppt part
st.markdown("## 可视化的用户群体")
st.markdown("#### 期货交易人员")
st.markdown(
    "问题1：期货交易人员可能对每日价格波动图和交易量柱状图感兴趣。他们关注价格的波动情况以及交易量的变化，以寻找交易机会和确定交易策略。")
st.markdown(
    "问题2：期货交易人员可能对涨跌幅随时间的累积效应和涨跌幅的时间热点感兴趣。他们可能想了解价格涨跌幅度的累积效应和在不同时间段内的涨跌热点，以便更好地把握市场走势。"
)
st.markdown("#### 金融分析人员")
st.markdown(
    "问题1：金融分析人员可能对不同年份收盘价的箱形图分析和季度平均交易量感兴趣。他们可能关注价格的分布情况和交易量的季度变化，以进行市场评估和预测。")
st.markdown(
    "问题2：金融分析人员可能对移动平均线分析和异常点检测感兴趣。他们可能使用移动平均线来观察价格的趋势，并通过检测异常点来识别潜在的市场异常情况。")
st.markdown(
    "问题3：金融分析人员可能对价格数据热图和收盘价季节性分析感兴趣。他们可能想了解价格的热门时段和季节性变化，以帮助他们制定投资策略和预测市场走势。")

st.markdown("## 讨论")
st.markdown("在期货价格的分析预测中，我们要面对多个复杂的数据集，在其中可视化起到了什么作用？")
st.markdown("看到一份数据，比如期货数据，会从哪些方面入手开始进行数据分析并可视化？")
